testdata/IN_2023_02/Roundtrip/produkt/rente/fr/FR - alles ohne VB Individualitaeten_2023_02b.xml_request_2023_02b.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Body>
    <tarif:getQuote xmlns:allg="http://www.bipro.net/namespace/allgemein" xmlns:basis="http://www.bipro.net/namespace/basis" xmlns:dt="http://www.bipro.net/namespace/datentypen" xmlns:gevo="http://www.bipro.net/namespace/gevo" xmlns:nachr="http://www.bipro.net/namespace/nachrichten" xmlns:partner="http://www.bipro.net/namespace/partner" xmlns:pm="http://www.bipro.net/namespace/produktmodell" xmlns:pm-leben="http://www.bipro.net/namespace/versicherung/produktmodell/leben" xmlns:tarif="http://www.bipro.net/namespace/versicherung/tarifierung" xmlns:vbl="urn:de:vb:bipro:taa:leben:1.12" xmlns:vs-pm="http://www.bipro.net/namespace/versicherung/produktmodell" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
          
      <tarif:Request>
                
        <nachr:BiPROVersion>2.4.6.1.12</nachr:BiPROVersion>
        <nachr:ConsumerID>WS DEV TEAM</nachr:ConsumerID>
                
        <tarif:Tarifierung>
                      
          <tarif:Partner xsi:type="partner:CT_Person">
                            
            <partner:Anrede>1</partner:Anrede>
                            
            <partner:Name>Mustermann</partner:Name>
                            
            <partner:PartnerID>1</partner:PartnerID>
                            
            <partner:Anschrift>
                                  
              <allg:Strasse>Münsterstr. 304</allg:Strasse>
                                  
              <allg:Postleitzahl>40476</allg:Postleitzahl>
                                  
              <allg:Ort>Düsseldorf</allg:Ort>
                              
            </partner:Anschrift>
                            
            <partner:Vorname>Max</partner:Vorname>
                            
            <partner:Geburtsdatum>1992-11-01</partner:Geburtsdatum>
                            
            <partner:Geschlecht>1</partner:Geschlecht>
                        
          </tarif:Partner>
                      
          <tarif:Verkaufsprodukt>
                            
            <pm:Produkt xsi:type="pm-leben:CT_Produkt">
                                  
              <pm:GewuenschteZahlungsweise>8</pm:GewuenschteZahlungsweise>
                                  
              <pm:Beitrag>
                                        
                <pm:ArtID xsi:type="dt:STE_BeitragBasis">01</pm:ArtID>
                                        
                <pm:Betrag>
                                            
                  <allg:Betrag>1000</allg:Betrag>
                                            
                  <allg:Waehrung>EUR</allg:Waehrung>
                                          
                </pm:Betrag>
                                        
                <pm:Zahlungsweise>6</pm:Zahlungsweise>
                                    
              </pm:Beitrag>
                                  
              <pm:Beitrag>
                                        
                <pm:ArtID xsi:type="dt:STE_BeitragBasis">01</pm:ArtID>
                                        
                <pm:Betrag>
                                            
                  <allg:Betrag>200</allg:Betrag>
                                            
                  <allg:Waehrung>EUR</allg:Waehrung>
                                          
                </pm:Betrag>
                                        
                <pm:Zahlungsweise>8</pm:Zahlungsweise>
                                        
                <pm:Erhebung>
                                              
                  <allg:AnzahlJahre>25</allg:AnzahlJahre>
                                              
                  <allg:AnzahlMonate>0</allg:AnzahlMonate>
                                          
                </pm:Erhebung>
                                    
              </pm:Beitrag>
                                  
              <pm:Beitrag>
                                        
                <pm:ArtID xsi:type="dt:STE_BeitragBasis">02</pm:ArtID>
                                        
                <pm:Betrag>
                                            
                  <allg:Betrag>200</allg:Betrag>
                                            
                  <allg:Waehrung>EUR</allg:Waehrung>
                                          
                </pm:Betrag>
                                        
                <pm:Zahlungsweise>8</pm:Zahlungsweise>
                                        
                <pm:Erhebung>
                                              
                  <allg:AnzahlJahre>25</allg:AnzahlJahre>
                                              
                  <allg:AnzahlMonate>0</allg:AnzahlMonate>
                                          
                </pm:Erhebung>
                                    
              </pm:Beitrag>
                                  
              <pm:Versicherungsdauer>
                                      
                <allg:Beginn>2023-03-01T12:00</allg:Beginn>
                 
                    
              </pm:Versicherungsdauer>
                                  
              <pm:Kennung>FR</pm:Kennung>
                                  
              <pm:Elementarprodukt xsi:type="pm-leben:CT_Rente">
                                        
                <pm:Beitrag>
                                              
                  <pm:ArtID xsi:type="dt:STE_BeitragBasis">01</pm:ArtID>
                                              
                  <pm:Betrag>
                                                  
                    <allg:Betrag>200</allg:Betrag>
                                                  
                    <allg:Waehrung>EUR</allg:Waehrung>
                                                
                  </pm:Betrag>
                                              
                  <pm:Zahlungsweise>8</pm:Zahlungsweise>
                                              
                  <pm:Erhebung>
                                                    
                    <allg:AnzahlJahre>25</allg:AnzahlJahre>
                                                    
                    <allg:AnzahlMonate>0</allg:AnzahlMonate>
                                                
                  </pm:Erhebung>
                                          
                </pm:Beitrag>
                                        
                <pm:Versicherungsdauer>
                                              
                  <allg:AnzahlJahre>27</allg:AnzahlJahre>
                                              
                  <allg:AnzahlMonate>4</allg:AnzahlMonate>
                                          
                </pm:Versicherungsdauer>
                                        
                <vs-pm:VersicherungssummeOderLeistung>
                                              
                  <vs-pm:ArtID xsi:type="dt:STE_VersicherungssummeOderLeistungBasis">GarantierteRente</vs-pm:ArtID>
                                              
                  <vs-pm:Wert>100</vs-pm:Wert>
                                              
                  <vs-pm:Waehrung>EUR</vs-pm:Waehrung>
                                              
                  <vs-pm:Auszahlungsweise>8</vs-pm:Auszahlungsweise>
                                              
                  <vs-pm:Zeitraum>
                                                    
                    <allg:AnzahlJahre>25</allg:AnzahlJahre>
                                                    
                    <allg:AnzahlMonate>0</allg:AnzahlMonate>
                                                
                  </vs-pm:Zeitraum>
                                              
                  <vs-pm:GarantierteErhoehung>
                                                    
                    <pm:ArtID xsi:type="dt:STE_DynamikBasis">01</pm:ArtID>
                                                    
                    <pm:Frequenz xsi:type="dt:STE_FrequenzBasis">jaehrlich</pm:Frequenz>
                                                    
                    <pm:Wert>2</pm:Wert>
                                                    
                    <pm:KategorieID>Leistung</pm:KategorieID>
                                                
                  </vs-pm:GarantierteErhoehung>
                                          
                </vs-pm:VersicherungssummeOderLeistung>
                                        
                <vs-pm:VersicherungssummeOderLeistung>
                                              
                  <vs-pm:ArtID xsi:type="dt:STE_VersicherungssummeOderLeistungBasis">GesamteRente</vs-pm:ArtID>
                                              
                  <vs-pm:Wert>130</vs-pm:Wert>
                                              
                  <vs-pm:Waehrung>EUR</vs-pm:Waehrung>
                                              
                  <vs-pm:Auszahlungsweise>8</vs-pm:Auszahlungsweise>
                                              
                  <vs-pm:Zeitraum>
                                                    
                    <allg:AnzahlJahre>25</allg:AnzahlJahre>
                                                    
                    <allg:AnzahlMonate>0</allg:AnzahlMonate>
                                                
                  </vs-pm:Zeitraum>
                                          
                </vs-pm:VersicherungssummeOderLeistung>
                                        
                <vs-pm:VersicherungssummeOderLeistung>
                                              
                  <vs-pm:ArtID xsi:type="dt:STE_VersicherungssummeOderLeistungBasis">GesamteAblaufleistung</vs-pm:ArtID>
                                              
                  <vs-pm:Wert>175000</vs-pm:Wert>
                                              
                  <vs-pm:Waehrung>EUR</vs-pm:Waehrung>
                                              
                  <vs-pm:Auszahlungsweise>6</vs-pm:Auszahlungsweise>
                                          
                </vs-pm:VersicherungssummeOderLeistung>
                                        
                <pm-leben:Hochrechnungszins>7</pm-leben:Hochrechnungszins>
                                        
                <pm-leben:IstHauptversicherung>true</pm-leben:IstHauptversicherung>
                                        
                <pm-leben:UeberschussverwendungVorLeistung xsi:type="dt:STE_UeberschussverwendungBasis">12</pm-leben:UeberschussverwendungVorLeistung>
                                        
                <pm-leben:VersichertePerson>
                                              
                  <partner:PartnerID>1</partner:PartnerID>
                                          
                </pm-leben:VersichertePerson>
                                        
                <pm-leben:BeitragsRueckgewaehrBeiTod>01</pm-leben:BeitragsRueckgewaehrBeiTod>
                                        
                <pm-leben:BeitragsRueckgewaehrBeiAblauf>false</pm-leben:BeitragsRueckgewaehrBeiAblauf>
                                        
                <pm-leben:Garantiezeit>
                                              
                  <allg:AnzahlJahre>10</allg:AnzahlJahre>
                                              
                  <allg:AnzahlMonate>0</allg:AnzahlMonate>
                                          
                </pm-leben:Garantiezeit>
                                    
              </pm:Elementarprodukt>
                                  
              <pm-leben:VorgabeBerechnung>
                                        
                <pm-leben:ArtID xsi:type="dt:STE_VorgabeBerechnungBasis">Bruttobeitrag</pm-leben:ArtID>
                                        
                <pm-leben:Kontext xsi:type="dt:STE_VorgabeBerechnungKontextBasis">Produkt</pm-leben:Kontext>
                                    
              </pm-leben:VorgabeBerechnung>
                              
            </pm:Produkt>
                        
          </tarif:Verkaufsprodukt>
                  
        </tarif:Tarifierung>
            
      </tarif:Request>
      
    </tarif:getQuote>
  </soapenv:Body>
</soapenv:Envelope>
